package oop;

import java.util.ArrayList;

public class Oop {
    String decodingOop = "OOP(ООП) - расшифровываеться как обектно орентированное програмирование.\n" +
            "            Язык прогромирования java входит в их число.\n" +
            "            Все взаимодействия компонентов связаны на основе OOP.\n" +
            "            Одни обекты взаимодейстуются с другими обектами (Классами).\n" +
            "Какими характеристиками обладают обекты ?\n" +
            "            1) Состояние (Например, что взаимодействует со мной: Имя, Фамилия, Возрост и тому подобное).\n" +
            "            2) Повидение (Например: этот человек с такимто именем, пощёл гулят. И описать как он это сделал).";
}