package oop;

public class Polymorphis  {
    String decodingPolymorphis = "Полиморфизм - улучшает организацю кода и его читабельность,\n" +
            "          а тагже спопствует созданию расширяемых програм, которые могут рости в процессе\n" +
            "          начальной разработки проекта, но и при добовлении новых возможностей\n" +
            "Например: добовлять несколько реализаций одлному и томуже метаду или конструкцию\n" +
            "          Переопределять на уровне класса наследника метод";
}
