package collectionsJava;

public class CollectionList {
    String decodingList = "Колекция Лист - это пронумерованный набор элементов.\n" +
            "               Пользователь этого интерфейса имеет точный контроль над тем где в списке\n" +
            "               вставляется каждый элемент.\n " +

            "              Пользователь может обращаться к элементам по их индексу(позиции в списке)\n " +
            "              и искать элементы в списке.\n " +
            "              Работает по принцепу первый элемент добавил, пепервый и выведет.";
}
