package javaCore;

public class Oop {
    String decodingOop = "OOP(ООП) - расшифровывается, как объектно ориентированное программирование.\n" +
            "            Язык программирования java входит в их число.\n" +
            "            Все взаимодействия компонентов связаны на основе OOP.\n" +
            "            Одни обекты взаимодейстуют с другими обектами (Классами).\n" +
            "Какими характеристиками обладают объекты ?\n" +
            "            1) Состояние (Например, что взаимодействует со мной: Имя, Фамилия, Возраст и тому подобное).\n" +
            "            2) Поведение (Например: этот человек с таким-то именем, пошёл гулять. И описать, как он это сделал).";
}