package javaCore;

public class Polymorphis  {
    String decodingPolymorphis = "Полиморфизм - улучшает организацю кода и его читабельность,\n" +
            "          а также способствует созданию расширяемых программ, которые могут расти в процессе\n" +
            "          начальной разработки проекта, но и при добавлении новых возможностей\n" +
            "Например: добавлять несколько реализаций одному и тому же методу или конструкции\n" +
            "          Переопределять на уровне класса наследника метод";
}
